load_testing/results_for_report/long_comp/dyn_3_peaks_360s_10keys_1600r.txt
CONNECTED to addr	172.31.11.13:3000
CONNECTED to addr	172.31.10.136:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.11.13:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.10.136:3000
Running 6m test @ http://172.31.11.13:3000
  2 threads and 200 connections
  Thread calibration: mean lat.: 523.801ms, rate sampling interval: 3883ms
  Thread calibration: mean lat.: 461.200ms, rate sampling interval: 3446ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.27ms   44.58ms   1.42s    98.63%
    Req/Sec   799.66      8.98     0.87k    95.81%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.52ms
 75.000%    6.01ms
 90.000%    8.07ms
 99.000%  103.49ms
 99.900%  775.68ms
 99.990%    1.07s 
 99.999%    1.18s 
100.000%    1.42s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.491     0.000000            1         1.00
       3.075     0.100000        56032         1.11
       3.377     0.200000       111891         1.25
       3.685     0.300000       168086         1.43
       4.049     0.400000       223892         1.67
       4.523     0.500000       279986         2.00
       4.763     0.550000       307685         2.22
       5.015     0.600000       335879         2.50
       5.283     0.650000       363613         2.86
       5.603     0.700000       391646         3.33
       6.015     0.750000       419591         4.00
       6.239     0.775000       433438         4.44
       6.483     0.800000       447391         5.00
       6.755     0.825000       461468         5.71
       7.083     0.850000       475402         6.67
       7.503     0.875000       489322         8.00
       7.771     0.887500       496391         8.89
       8.067     0.900000       503279        10.00
       8.447     0.912500       510365        11.43
       8.935     0.925000       517282        13.33
       9.663     0.937500       524266        16.00
      10.207     0.943750       527743        17.78
      11.007     0.950000       531253        20.00
      12.207     0.956250       534741        22.86
      14.079     0.962500       538232        26.67
      17.087     0.968750       541733        32.00
      19.071     0.971875       543476        35.56
      21.647     0.975000       545218        40.00
      25.007     0.978125       546969        45.71
      30.223     0.981250       548715        53.33
      40.895     0.984375       550464        64.00
      51.039     0.985938       551338        71.11
      66.559     0.987500       552211        80.00
      86.591     0.989062       553081        91.43
     117.503     0.990625       553956       106.67
     162.047     0.992188       554832       128.00
     189.183     0.992969       555270       142.22
     220.031     0.993750       555703       160.00
     258.559     0.994531       556139       182.86
     308.735     0.995313       556578       213.33
     358.399     0.996094       557013       256.00
     396.543     0.996484       557234       284.44
     423.679     0.996875       557452       320.00
     466.175     0.997266       557668       365.71
     513.791     0.997656       557889       426.67
     572.415     0.998047       558105       512.00
     606.207     0.998242       558215       568.89
     642.047     0.998437       558325       640.00
     686.079     0.998633       558434       731.43
     734.719     0.998828       558543       853.33
     779.775     0.999023       558652      1024.00
     815.103     0.999121       558706      1137.78
     843.263     0.999219       558761      1280.00
     867.839     0.999316       558815      1462.86
     893.439     0.999414       558870      1706.67
     936.447     0.999512       558925      2048.00
     953.343     0.999561       558952      2275.56
     966.655     0.999609       558979      2560.00
     980.991     0.999658       559006      2925.71
     997.375     0.999707       559035      3413.33
    1014.783     0.999756       559061      4096.00
    1027.583     0.999780       559075      4551.11
    1037.311     0.999805       559088      5120.00
    1046.015     0.999829       559102      5851.43
    1053.695     0.999854       559116      6826.67
    1061.887     0.999878       559131      8192.00
    1067.007     0.999890       559136      9102.22
    1074.175     0.999902       559143     10240.00
    1080.319     0.999915       559151     11702.86
    1083.391     0.999927       559157     13653.33
    1091.583     0.999939       559164     16384.00
    1096.703     0.999945       559167     18204.44
    1098.751     0.999951       559172     20480.00
    1101.823     0.999957       559174     23405.71
    1110.015     0.999963       559177     27306.67
    1117.183     0.999969       559181     32768.00
    1118.207     0.999973       559182     36408.89
    1122.303     0.999976       559184     40960.00
    1132.543     0.999979       559186     46811.43
    1139.711     0.999982       559187     54613.33
    1149.951     0.999985       559189     65536.00
    1160.191     0.999986       559190     72817.78
    1176.575     0.999988       559191     81920.00
    1180.671     0.999989       559192     93622.86
    1180.671     0.999991       559192    109226.67
    1205.247     0.999992       559193    131072.00
    1231.871     0.999993       559194    145635.56
    1231.871     0.999994       559194    163840.00
    1259.519     0.999995       559195    187245.71
    1259.519     0.999995       559195    218453.33
    1259.519     0.999996       559195    262144.00
    1319.935     0.999997       559196    291271.11
    1319.935     0.999997       559196    327680.00
    1319.935     0.999997       559196    374491.43
    1319.935     0.999998       559196    436906.67
    1319.935     0.999998       559196    524288.00
    1418.239     0.999998       559197    582542.22
    1418.239     1.000000       559197          inf
#[Mean    =        9.268, StdDeviation   =       44.580]
#[Max     =     1417.216, Total count    =       559197]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  575697 requests in 6.00m, 140.55MB read
  Non-2xx or 3xx responses: 60
Requests/sec:   1599.16
Transfer/sec:    399.80KB
thread 0 made 287851 requests and got 287850 responses
thread 1 made 287850 requests and got 287847 responses

2022-06-07 01:33:58.500 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN 
2022-06-07 01:34:04.135 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 2.269511638521223 
2022-06-07 01:34:08.506 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1236909471724459 
2022-06-07 01:34:13.516 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1208213346688367 
2022-06-07 01:34:18.511 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.125 
2022-06-07 01:34:23.519 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1178102926337035 
2022-06-07 01:34:28.521 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1034526209677418 
2022-06-07 01:34:33.520 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1047678795483062 
2022-06-07 01:34:38.523 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1204274041483344 
2022-06-07 01:34:43.518 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1075647147524503 
2022-06-07 01:34:48.522 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0999624201428035 
2022-06-07 01:34:53.523 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1075996990218209 
2022-06-07 01:34:58.524 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1245765901392548 
2022-06-07 01:35:03.542 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1139954853273137 
2022-06-07 01:35:08.529 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1487509462528387 
2022-06-07 01:35:13.539 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.117757712565839 
2022-06-07 01:35:18.536 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1011702529256324 
2022-06-07 01:35:23.530 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1436110064078402 
2022-06-07 01:35:28.536 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1083427708569271 
2022-06-07 01:35:33.539 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1253296496295366 
2022-06-07 01:35:38.541 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1304129534329108 
2022-06-07 01:35:43.548 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1301782575947776 
2022-06-07 01:35:48.544 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1061157855079744 
2022-06-07 01:35:53.558 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1604659902292371 
2022-06-07 01:35:58.554 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.158139534883721 
2022-06-07 01:36:03.574 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.10863020572002 
2022-06-07 01:36:08.552 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0756217649286706 
2022-06-07 01:36:13.558 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3845284440537484 
2022-06-07 01:36:18.554 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.89913109180204 
2022-06-07 01:36:23.592 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.9004372267332916 
2022-06-07 01:36:28.584 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1210705718974876 
2022-06-07 01:36:33.563 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0857178873061892 
2022-06-07 01:36:38.563 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.093984962406015 
2022-06-07 01:36:43.564 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1412429378531073 
2022-06-07 01:36:48.574 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.113781449493053 
2022-06-07 01:36:53.568 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0767783214151299 
2022-06-07 01:36:58.575 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1366762535950983 
2022-06-07 01:37:03.576 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1013039117352057 
2022-06-07 01:37:08.619 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1145963509122718 
2022-06-07 01:37:13.576 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1374209860935525 
2022-06-07 01:37:18.583 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1305872042068361 
2022-06-07 01:37:23.591 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1052037617554857 
2022-06-07 01:37:28.589 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.135063957863055 
2022-06-07 01:37:33.589 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.107183151560737 
2022-06-07 01:37:38.589 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.115050924179555 
2022-06-07 01:37:43.596 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0799398571607568 
2022-06-07 01:37:48.590 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.116997238262616 
2022-06-07 01:37:53.616 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.125985237082447 
2022-06-07 01:37:58.603 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1239105721864342 
2022-06-07 01:38:03.708 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.128935532233883 
2022-06-07 01:38:08.603 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1009880662132683 
2022-06-07 01:38:13.617 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1057571964956194 
2022-06-07 01:38:18.601 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1157180550320391 
2022-06-07 01:38:23.606 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1262670504317358 
2022-06-07 01:38:28.679 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.9655301611090297 
2022-06-07 01:38:33.614 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.062929061784897 
2022-06-07 01:38:38.624 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1061746987951808 
2022-06-07 01:38:43.620 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0634721525338684 
2022-06-07 01:38:48.622 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0682871820573863 
2022-06-07 01:38:53.620 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.116060225846926 
2022-06-07 01:38:58.673 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.065217391304348 
2022-06-07 01:39:03.671 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.089181656954649 
2022-06-07 01:39:08.633 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0738399291945884 
2022-06-07 01:39:13.631 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1075012543903662 
2022-06-07 01:39:18.628 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0601277715144684 
2022-06-07 01:39:23.633 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0841788801202557 
2022-06-07 01:39:28.641 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1094707869385712 
2022-06-07 01:39:33.639 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0937147158449378 
2022-06-07 01:39:38.646 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.098321643286573 
2022-06-07 01:39:43.650 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0840020060180542 
2022-06-07 01:39:48.652 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0842647243501193 
2022-06-07 01:39:53.650 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0878666332414137 
2022-06-07 01:39:58.651 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1092184368737474 
2022-06-07 01:40:03.650 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.066543438077634 
2022-06-07 01:40:08.653 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN